//Непосредственное выполнение алгоритма расчета. Возврат - таблица расчета метрики.
Функция ВыполнитьАлгоритмРасчетаМетрики(АлгоритмПолучения, ОписаниеОшибки = Неопределено)
	     		
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Попытка
		Выполнить(АлгоритмПолучения);
	Исключение
		Если ОписаниеОшибки = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Расчет метрик Prometheus",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегламентныеЗадания.prПредварительныйРасчетМетрик,
			,
			ОписаниеОшибки());
		Иначе
			ОписаниеОшибки = ОписаниеОшибки();
		КонецЕсли; 
	КонецПопытки;
	
	Возврат ТаблицаЗначений;
	
КонецФункции

//Получение метрик методом PULL
Функция ПолучитьМетрики() Экспорт
	
	//Надо получить метрики для тех, что "по запросу" и тех, что "регламентом"
	//Выполнение методов должно быть асинхронным, однако результирующее значение одно
	//В случае использования многопоточности, ветка "по запросу" должна делиться на потоки
	ПоЗапросуМногопоточно = Константы.пэмМногопоточныйРасчетМетрикПоЗапросу.Получить();
	ПоЗапросуКоличествоПотоков = Константы.пэмКоличествоПотоковРасчетаМетрикПоЗапросу.Получить();
	ИтоговаяМетрика = "";
	
	Если ПоЗапросуМногопоточно Тогда
		ПолучитьМетрикиПоЗапросуМногопоточно(ИтоговаяМетрика, ПоЗапросуКоличествоПотоков)
	Иначе
		ПолучитьМетрикиПоЗапросу(ИтоговаяМетрика)
	КонецЕсли;
		
	Возврат ИтоговаяМетрика;
	
КонецФункции

Процедура ПолучитьМетрикиПоЗапросу(Метрика)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	
КонецПроцедуры

Процедура ПолучитьМетрикиПоЗапросуМногопоточно(Метрика, КоличествоПотоков)
	
	Метрика = "";
	
КонецПроцедуры
