

&НаКлиенте
Процедура пэмИспользоватьPushgatewayПриИзменении(Элемент)
	
	Элементы.ГруппаPushgatewayСервер.Доступность = Константы.пэмИспользоватьPushgateway;
	Константы.пэмАдресСервераPushgateway = "";
	Константы.пэмПортСервераPushgateway = 0;
		
КонецПроцедуры

&НаКлиенте
Процедура пэмМногопоточныйРасчетМетрикПоЗапросуПриИзменении(Элемент)
	
	Элементы.пэмКоличествоПотоковРасчетаМетрикПоЗапросу.Доступность = Константы.пэмМногопоточныйРасчетМетрикПоЗапросу;
	Если Константы.пэмМногопоточныйРасчетМетрикПоЗапросу Тогда
		Константы.пэмКоличествоПотоковРасчетаМетрикПоЗапросу = 2;
	Иначе
		Константы.пэмКоличествоПотоковРасчетаМетрикПоЗапросу = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура пэмМногопоточныйРасчетМетрикРегламентомПриИзменении(Элемент)
	
	Элементы.пэмКоличествоПотоковРасчетаМетрикПоЗапросу.Доступность = Константы.пэмМногопоточныйРасчетМетрикРегламентом;
	Если Константы.пэмМногопоточныйРасчетМетрикРегламентом Тогда
		Константы.пэмКоличествоПотоковРасчетаМетрикРегламентом = 2;
	Иначе
		Константы.пэмКоличествоПотоковРасчетаМетрикРегламентом = 0;
	КонецЕсли;
	
КонецПроцедуры


