Функция ОпределитьРасписаниеРегламентногоЗаданияИнтерактивно(Расписание = Неопределено) Экспорт
	
	Если Расписание = Неопределено Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.ОткрытьМодально();
	Возврат Диалог.Расписание;
		
КонецФункции

Функция ПолучитьПредставлениеРасписания(Расписание = Неопределено, Активно = Истина) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат НСтр("ru = '<Расписание не задано>'");
	КонецЕсли;
	
	Если Активно Тогда
		ПрефиксРасписания = НСтр("ru = 'Расписание: '");
	Иначе
		ПрефиксРасписания = НСтр("ru = 'Расписание (НЕ АКТИВНО): '");
	КонецЕсли;
		
	Возврат ПрефиксРасписания + Строка(Расписание);

КонецФункции