Функция ОпределитьРасписаниеРегламентногоЗаданияИнтерактивно(Расписание = Неопределено) Экспорт
	
	Если Расписание = Неопределено Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.ОткрытьМодально();
	Возврат Диалог.Расписание;
		
КонецФункции

Функция ПолучитьПредставлениеРасписания(Расписание = Неопределено, Используется = Истина) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат НСтр("ru = '<Расписание не задано>'");
	КонецЕсли;
	
	Если Используется Тогда
		ПрефиксРасписания = НСтр("ru = ''");
	Иначе
		ПрефиксРасписания = НСтр("ru = '(НЕ АКТИВНО) '");
	КонецЕсли;
		
	Возврат ПрефиксРасписания + Строка(Расписание);

КонецФункции