&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыРегламентногоЗадания = пэмМетрикиСервер.ПолучитьПараметрыРегламентногоЗадания();
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
	
	//test
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПервоначальноеЗаполнениеНаСервере()
	
	пэмМетрикиСервер.ВыполнитьПервоначальноеЗаполнение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПервоначальноеЗаполнение(Команда)
	
	ВыполнитьПервоначальноеЗаполнениеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеФормы() Экспорт
	
	ПредставлениеРасписания = пэмМетрикиКлиент.ПолучитьПредставлениеРасписания(ПараметрыРегламентногоЗадания);
	Использование = ПараметрыРегламентногоЗадания.Использование;
	
	Элементы.ГруппаPushgatewayСервер.Доступность = Константы.пэмИспользоватьPushgateway;
	Элементы.ОписаниеРасписанияМетрики.Заголовок = ПредставлениеРасписания;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы",0.1,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Константы.пэмИспользоватьPushgateway Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Константы");
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбщийРегламентПриИзменении(Элемент)
	
	ПараметрыРегламентногоЗадания.Использование = Использование;
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура пэмИспользоватьPushgatewayПриИзменении(Элемент)
	
	Если Константы.пэмИспользоватьPushgateway Тогда
		Константы.пэмПутьНаСервереPushgateway = "/metrics/job/pushgateway/instance/product";
		Константы.пэмАдресСервераPushgateway = "";
		Константы.пэмПортСервераPushgateway = 9091;
	Иначе
		Константы.пэмПутьНаСервереPushgateway = "";
		Константы.пэмАдресСервераPushgateway = "";
		Константы.пэмПортСервераPushgateway = 0;
		ПараметрыРегламентногоЗадания.Использование = Ложь;
	КонецЕсли;
		
	ПодключитьОбработчикОжидания("ОбновитьСостояниеФормы",0.1,Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	пэмМетрикиСервер.ОбновитьРегламентноеЗадание(ПараметрыРегламентногоЗадания);
			
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеРасписанияМетрикиНажатие(Элемент)
	
	пэмМетрикиКлиент.ОбработатьИзменениеРасписания(ПараметрыРегламентногоЗадания,ЭтаФорма);
	
КонецПроцедуры
