Функция PollingGet(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);	
		
	UserAgent = Запрос.Заголовки.Получить("User-Agent"); 
	Accept = Запрос.Заголовки.Получить("Accept");
	
	Если UserAgent = Неопределено ИЛИ Accept = Неопределено Тогда
		Возврат Новый HTTPСервисОтвет(400);
	КонецЕсли;
	
	Если (СтрНайти(Accept,"text/plain") = 0) Тогда
		Возврат Новый HTTPСервисОтвет(405);	
	КонецЕсли;
	
	МетрикиСтрокой = пэмМетрикиСервер.ПолучитьМетрики();

	Если НЕ ЗначениеЗаполнено(МетрикиСтрокой) Тогда
		Возврат Новый HTTPСервисОтвет(418);	
	КонецЕсли; 
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(МетрикиСтрокой,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции

