
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ОписаниеМетрики) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	пэмМетрики.Ссылка,
		               |	пэмМетрики.Наименование,
		               |	пэмМетрики.ОписаниеМетрики
		               |ИЗ
		               |	Справочник.пэмМетрики КАК пэмМетрики
		               |ГДЕ
		               |	пэмМетрики.Ссылка <> &Ссылка
		               |	И пэмМетрики.ОписаниеМетрики = &ОписаниеМетрики";
		Запрос.УстановитьПараметр("Ссылка",   	Ссылка);
		Запрос.УстановитьПараметр("ОписаниеМетрики", ОписаниеМетрики);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			prРасчетМетрикPrometheusСервер.СообщитьПользователю("ru = 'Имя метрики уже используется в " + Выборка.Наименование, Ссылка, "Объект.ОписаниеМетрики",, Отказ);
		КонецЕсли;
			
		Если НЕ prРасчетМетрикPrometheusСервер.СтрокаСоответствуетШаблону(ОписаниеМетрики) Тогда
			prРасчетМетрикPrometheusСервер.СообщитьПользователю(НСтр("ru = 'Имя метрики не соответствует шаблону [a-zA-Z_:]([a-zA-Z0-9_:])*'"), Ссылка, "Объект.ОписаниеМетрики",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ИспользоватьПредварительныйРасчет Тогда
		ПроверяемыеРеквизиты.Добавить("СрокДействияПредварительногоРасчета");
	КонецЕсли;

	
КонецПроцедуры

